Revit 2024 API
OverrideGraphicSettings.ProjectionLinePatternId Property
 Id of the projection surface line pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId ProjectionLinePatternId { get; }
Visual Basic
Public ReadOnly Property ProjectionLinePatternId As ElementId
	Get
Visual C++
public:
property ElementId^ ProjectionLinePatternId {
	ElementId^ get ();
}
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace